In [1]:
import pandas as pd
import numpy as np

In [2]:
# Both methods are used to aggregate a df
df = pd.DataFrame(
    {'a': [1,2,3,1,2,3],
     'b': [1,1,1,2,2,2],
     'c': np.random.rand(6)}
     )
df

   a  b         c
0  1  1  0.415216
1  2  1  0.122006
2  3  1  0.611132
3  1  2  0.337492
4  2  2  0.998383
5  3  2  0.842198

In [3]:
# pivot_table() creates a table where 'a' is on the row axis
# 'b' on the column axis and the values are the sum of 'c'

pd.pivot_table(df, index='a', columns='b', values='c', aggfunc='sum')

b         1         2
a
1  0.415216  0.337492
2  0.122006  0.998383
3  0.611132  0.842198

In [4]:
# using groupby the dimensions given are placen into columns,
# and rows are created for each combination of those dimensions

df.groupby(['a', 'b'])['c'].sum()

a  b
1  1    0.415216
   2    0.337492
2  1    0.122006
   2    0.998383
3  1    0.611132
   2    0.842198
Name: c, dtype: float64

In [5]:
# by ommiting 'c' you can create a df instead of a series
df.groupby(['a', 'b']).sum()

            c
a b
1 1  0.415216
  2  0.337492
2 1  0.122006
  2  0.998383
3 1  0.611132
  2  0.842198

In [6]:
# extra line